app/controllers/blogs_controller.rb

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `blogs`
SELECT `blogs`.* FROM `blogs` ORDER BY created_at DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)
---
  def index
    @blog =Blog.find(1)
    @blogs = Blog.includes(:user).page(params[:page]).per(5).order("created_at DESC")

INSERT INTO `blogs` (`text`, `created_at`, `updated_at`, `user_id`) VALUES ('てすと', '2019-03-30 02:10:49', '2019-03-30 02:10:49', 1)
INSERT INTO `blogs` (`created_at`, `updated_at`, `user_id`) VALUES ('2019-03-30 03:35:04', '2019-03-30 03:35:04', 1)
---
  def create
    Blog.create(blog_params)
    Blog.create(text: blog_params[:text], user_id: current_user.id)

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 7 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 7
---
  def destroy
    blog = Blog.find(params[:id])
    blog.destroy if blog.user_id == current_user.id

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 6 LIMIT 1
UPDATE `blogs` SET `text` = 'とうこうぶん更新完了', `updated_at` = '2019-03-30 02:35:22' WHERE `blogs`.`id` = 6
---
  def update
    blog = Blog.find(params[:id])
    if blog.user_id == current_user.id
      blog.update(blog_params)